Revit 2027 API
RebarHookType.CreateDefaultRebarHookType Method
 Creates a new RebarHookType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultRebarHookType(
	Document ADoc
)
Public Shared Function CreateDefaultRebarHookType (
	ADoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultRebarHookType(
	Document^ ADoc
)
static member CreateDefaultRebarHookType :
        ADoc : Document -> ElementId
Parameters
ADoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace